# list_1 = [1, 2, 3, 4, 5, 1, 3, 3]
# k = 3
# count = 0
# for i in list_1:
#     if k == i:
#         count += 1
# print(count)

#######################################################################################################################

# Требуется найти в массиве list_1 самый близкий по величине элемент к заданному числу k и вывести его.

# list_1 = [2, 4, 1, 6, 8, 2, 9, 3, 2, 5]
# k = 10
#
# list_1 = [1, 4, 3, 7, 8, 9, 2]
# k = 8
# list_1 = [1, 12, 6, 7, 8, 15]
# k = 11

# smallest = k
# total = 0
# for i in range(len(list_1)):
#     if abs(k - list_1[i]) <= smallest:
#         smallest = k - list_1[i]
#         total = list_1[i]
# print(total)

#######################################################################################################################

# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
#
# В случае с английским алфавитом очки распределяются так:
#
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
#
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова k и выводит его. Будем считать, что
# на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

# d = {'A': 1, 'E': 1, 'I': 1, 'O': 1, 'U': 1, 'L': 1, 'N': 1, 'S': 1, 'T': 1, 'R': 1, 'D': 2, 'G': 2, 'B': 3, 'C': 3,
#
#      'M': 3, 'P': 3, 'F': 4, 'H': 4, 'V': 4, 'W': 4, 'Y': 4, 'K': 5, 'J': 8, 'X': 8, 'Q': 10, 'Z': 10, 'А': 1, 'В': 1,
#
#      'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1, 'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2, 'Б': 3,
#
#      'Г': 3, 'Ё': 3, 'Ь': 3, 'Я': 3, 'Й': 4, 'Ы': 4, 'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5, 'Ш': 8, 'Э': 8, 'Ю': 8,
#
#      'Ф': 10, 'Щ': 10, 'Ъ': 10,
#
#      'a': 1, 'e': 1, 'i': 1, 'o': 1, 'u': 1, 'l': 1, 'n': 1, 's': 1, 't': 1, 'r': 1, 'd': 2, 'g': 2, 'b': 3, 'c': 3,
#
#      'm': 3, 'p': 3, 'f': 4, 'h': 4, 'v': 4, 'w': 4, 'y': 4, 'k': 5, 'j': 8, 'x': 8, 'q': 10, 'z': 10, 'а': 1, 'в': 1,
#
#      'е': 1, 'и': 1, 'н': 1, 'о': 1, 'р': 1, 'с': 1, 'т': 1, 'д': 2, 'к': 2, 'л': 2, 'м': 2, 'п': 2, 'у': 2, 'б': 3,
#
#      'г': 3, 'ё': 3, 'ь': 3, 'я': 3, 'й': 4, 'ы': 4, 'ж': 5, 'з': 5, 'х': 5, 'ц': 5, 'ч': 5, 'ш': 8, 'э': 8, 'ю': 8,
#
#      'ф': 10, 'щ': 10, 'ъ': 10
#      }
#
# k = str(input())
# total = 0
# for i in k:
#     for key in d:
#         if i == key:
#             total += d[key]
# print(total)

# решение от гб

# points_en = {1: 'AEIOULNSTR', 2: 'DG', 3: 'BCMP', 4: 'FHVWY', 5: 'K', 8: 'JX', 10: 'QZ'}
# points_ru = {1: 'АВЕИНОРСТ', 2: 'ДКЛМПУ', 3: 'БГЁЬЯ', 4: 'ЙЫ', 5: 'ЖЗХЦЧ', 8: 'ШЭЮ', 10: 'ФЩЪ'}
# word = k.upper()  # переводим все буквы в верхний регистр
# count = 0
# for i in word:
#     if i in 'QWERTYUIOPASDFGHJKLZXCVBNM':
#         for j in points_en:
#             if i in points_en[j]:
#                 count = count + j
#     else:
#         for j in points_en:
#             if i in points_ru[j]:
#                 count = count + j
# print(count)