# Обязательные задачи:
#
# Императивное программирование:
# Задача 1: Подсчет суммы четных чисел от 1 до N. Напишите программу, используя цикл, которая находит сумму всех четных
# чисел в диапазоне от 1 до заданного числа N.


# n = int(input())
# total = 0
# if n % 2 == 0:
#     for i in range(2, n + 1, 2):
#         total += i
# else:
#     for i in range(2, n, 2):
#         total += i
# print(total)

#######################################################################################################################

# Задача 2: Поиск наименьшего числа в списке. Напишите программу, которая находит наименьшее число в заданном списке с
# помощью цикла.

# n = int(input('Введите количество чисел: '))
# smallest = int(input('Введите число: '))
# for i in range(n - 1):
#     num = int(input('Введите число: '))
#     if num < smallest:
#         smallest = num
#
# print('Наименьшее число = ', smallest)

#######################################################################################################################

# Декларативное программирование:
# Задача 3: Вычисление факториала числа. Напишите программу, которая находит факториал заданного числа N с использованием
# рекурсии или встроенных функций.

# n = int(input('Введите число: '))
#
# from math import *
# print(factorial(n))

#######################################################################################################################

# Задача 4: Поиск уникальных элементов в списке. Напишите программу, которая создает новый список, содержащий
# только уникальные элементы из исходного списка.
#
# arr = [1, 1, 2, 6, 6, 8, 8, 8, 99, 9, 1]
# arr2 = list(set(arr))
# print(arr2)

#######################################################################################################################

# Дополнительные сложные задачи (по желанию):
#
# Императивное программирование:
# Задача 5: Поиск простых чисел. Напишите программу, которая находит все простые числа в заданном диапазоне от 1 до N.




# Задача 6: Упорядочивание списка. Напишите программу, которая сортирует список чисел в порядке возрастания с
# использованием пузырьковой сортировки или другого метода сортировки.


# Декларативное программирование:
# Задача 7: Поиск подстроки. Напишите программу, которая находит все вхождения заданной подстроки в строке с
# использованием встроенных функций.


# Задача 8: Вычисление суммы цифр числа. Напишите программу, которая вычисляет сумму всех цифр заданного числа,
# используя математические операции и деление нацело.