# 1
# Структурное программирование:
# __
# Трассировка пути в лабиринте:
#  __
# Описание: Имеется двумерный массив, представляющий лабиринт, где '0' - это проход, а '1' - это стена. Начальная и
# конечная точки заданы. Необходимо определить путь от начальной до конечной точки.
# Почему это структурное программирование: Задача может быть решена с помощью последовательных шагов, ветвлений (проверка
# на наличие стены или уже посещенной клетки) и циклов (для обработки всех возможных направлений движения).

# Задание: Создайте функцию, которая принимает двумерный массив (лабиринт) и начальную и конечную точки. Функция должна
# возвращать путь от начальной до конечной точки или сообщение, что путь невозможен.
# Входные данные:
# Двумерный массив размера MxN, где '0' - это проход, а '1' - это стена.


